{
	"global": {
		"about": "About me",
		"intro": "Intro",
		"skills": "Skills",
		"experience": "Experience",
		"education": "Education",
		"projects": "Projects",
		"cv": "Download CV",
		"contact": "Contact",
		"avaible": "Available for work",
		"aspirations": "Aspirations",
		"competences": "Competences",
		"language": "Languages"
	},
	"home": {
		"hello": "Hello world!",
		"intro": "My name is Oskar and I am a Frontend Developer. I started my programming journey in 2021. I spent almost four years working at VML, first as a Web Master and later as a Junior Frontend Developer. I'm passionate about art, psychology, and graphic design — which helps me maintain a strong focus on UI and UX in the projects I work on. I am looking for a position that will allow me to continue growing.",
		"technologies": "Technologies",
		"tools": "Tools",
		"design": "Design",
		"remote": "Remote",
		"education": {
			"school": "The Complex of State Art Schools in Krakow",
			"description": "Complete secondary education with specialization:",
			"specialization": "Graphics Design"
		},
		"aspirations": {
			"first": "Improving my skills in technologies I know, especially React and Next",
			"second": "Expanding skills and knowledge towards FrontEnd Development",
			"third": "Achieving senior-level knowledge and skills as quickly as possible"
		},
		"competences": {
			"first": "Constructive cooperation with people from the QC, FrontEnd, BackEnd, PM departments",
			"second": "Independence in assigned tasks",
			"third": "Creating solutions that meet customer needs",
			"fourth": "Creating detailed project documentation"
		},
		"language": {
			"polish": {
				"title": "Polish",
				"description": "Native"
			},
			"english": {
				"title": "English",
				"description": "Communicative level ( B1 - B2 )"
			}
		}
	},
	"projects": {
		"website": "See project website",
		"description": "Description:",
		"challenges": "Challenges:",
		"solutions": "Solutions:",
		"tasks": "Tasks:",

		"list": [
			{
				"slug": "curriculum-vitae",
				"title": "CV",
				"short": "Responsive CV app with dynamic routing and dark/light mode.",
				"image": "/assets/cv.png",
				"stack": ["Next", "TypeScript", "Tailwind"]
			},
			{
				"slug": "ar-project",
				"title": "AR Project",
				"short": "Responsive CV app with dynamic routing and dark/light mode.",
				"image": "/assets/ar-project.png",
				"stack": ["React", "TypeScript", "8th Wall", "Material UI"]
			},
			{
				"slug": "meridol-accessibility",
				"title": "Meridol Accessibility",
				"short": "WCAG-compliant website adaptation using AEM and jQuery.",
				"image": "/assets/meridol-accessibility.png",
				"stack": ["Adobe Experience Manager", "JavaScript", "jQuery", "SCSS", "WCAG"]
			},
			{
				"slug": "elmex-accessibility",
				"title": "Elmex Accessibility",
				"short": "New WCAG-compliant components and UI fixes in AEM environment.",
				"image": "/assets/elmex-accessibility.png",
				"stack": ["Adobe Experience Manager", "JavaScript", "jQuery", "SCSS", "WCAG"]
			},
			{
				"slug": "sanex-accessibility",
				"title": "Sanex Accessibility",
				"short": "Contrast tool implementation and component accessibility in AEM.",
				"image": "/assets/sanex-accessibility.png",
				"stack": ["Adobe Experience Manager", "JavaScript", "jQuery", "SCSS", "WCAG"]
			},
			{
				"slug": "pilka-nozna-pl",
				"title": "PilkaNożna.pl",
				"short": "Football blog built with WordPress and Blade.",
				"image": "/assets/pilka-nozna-pl.png",
				"stack": ["Wordpress", "Tailwind"]
			},
			{
				"slug": "trilllizo",
				"title": "Trillizo",
				"short": "Children’s clothing store built in WordPress with Elementor Pro.",
				"image": "/assets/trilllizo.png",
				"stack": ["Wordpress", "Elementor Pro"]
			}
		],
		"curriculum-vitae": {
			"image": "/assets/cv.png",
			"description": "A CV website created for the purpose of the recruitment process. Built with Next.js, it provided an opportunity for me to deepen my understanding of the framework and streamline the development workflow.",
			"challenges": "The biggest challenge was implementing the language switcher, light/dark theme, and font resizing — all of which I developed for the first time using Next.js.",
			"solutions": "I designed the entire user interface myself, drawing inspiration from Vercel and Notion. I aimed for a consistent and minimalist design. To increase accessibility for international recruiters, I added an English language version. I focused on writing clean, structured code — reusable elements were extracted into components. I chose Next.js for its dynamic routing capabilities (e.g., using slugs) and the ease of managing shared components like the SideNav and Toolbar.",
			"tasks": "UI design and implementation, dynamic routing, bilingual localization, styling with CSS variables and Tailwind, responsive layout, shared components, accessibility optimization, integration with react-icons and next-icons",
			"link": "https://cv.oskarwiktor.dev"
		},
		"ar-project": {
			"image": "/assets/ar-project.png",
			"description": "An AR project developed at the VML agency using React, TypeScript, and 8th Wall. As the application is not yet publicly available, I am omitting details regarding the client and specific functionalities. The app will be accessible by scanning a QR code placed on product packaging. Material UI was used to accelerate development of components and their variants.",
			"challenges": "The biggest challenge was working on an augmented reality application for the first time using 8th Wall. The project broadened my perspective and sparked my interest in developing within this area.",
			"solutions": "I co-developed the app alongside an experienced senior developer, who provided me with valuable feedback on code structure and best practices, which I then implemented. I worked on the multilingual setup (German and French), the quiz functionality, and other interactive components whose purpose cannot yet be disclosed.",
			"tasks": "Building UI components, quiz development, localization (DE/FR), AR integration with 8th Wall, collaboration with a senior developer, development with Material UI",
			"link": ""
		},
		"meridol-accessibility": {
			"image": "/assets/meridol-accessibility.png",
			"description": "A project carried out for Colgate-Palmolive in cooperation with the VML agency, based on AEM and developed using JavaScript, jQuery, and SCSS. The goal was to adapt meridol.de to WCAG accessibility standards.",
			"challenges": "The main challenge was the lack of direct access to the HTML structure of AEM components, which required adding ARIA attributes using a team-defined pattern implemented in jQuery. Additionally, all features had to be compatible with screen readers such as NVDA.",
			"solutions": "I implemented solutions such as a contrast tool, keyboard navigation (including tabbing on product pages), and UI adjustments. I collaborated with two developers, one of whom was an AEM specialist. All changes were implemented with future reuse across different markets in mind.",
			"tasks": "Implementing WCAG standards, developing a contrast tool, working with jQuery and AEM, ensuring accessibility for keyboard and screen reader users, UI optimization for users with disabilities",
			"link": "https://www.meridol.de/"
		},
		"elmex-accessibility": {
			"image": "/assets/elmex-accessibility.png",
			"description": "A project carried out for Colgate-Palmolive in cooperation with the VML agency, based on AEM and developed using JavaScript, jQuery, and SCSS. The aim was to ensure elmex.de meets WCAG accessibility standards and to implement new components compliant with those guidelines.",
			"challenges": "The main challenge was adapting the UI and new components to accessibility requirements, especially with limitations caused by AEM. This required great attention to detail and testing with screen readers.",
			"solutions": "I was responsible for implementing accessible components, improving contrast, adjusting color schemes, and fixing UI-related issues. All updates were made in collaboration with the frontend team, with future scalability in mind.",
			"tasks": "Implementation of accessible components, UI optimization in line with WCAG, working with jQuery and AEM, fixing visual issues, collaboration with the frontend team",
			"link": "https://www.elmex.de/"
		},
		"sanex-accessibility": {
			"image": "/assets/sanex-accessibility.png",
			"description": "A project developed for Colgate-Palmolive in collaboration with the VML agency, based on AEM and using JavaScript, jQuery, and SCSS. The goal was to align the sanex.co.uk website with WCAG accessibility standards.",
			"challenges": "The biggest challenge was implementing the contrast tool and adjusting various components — such as carousels and product filters — to meet accessibility requirements.",
			"solutions": "I implemented a contrast toggle and introduced UI changes across all pages. I also fixed filtering on the product page and adapted interactive components like carousels to follow WCAG standards.",
			"tasks": "Contrast tool implementation, carousel optimization, filter adjustments, WCAG-compliant UI changes, working with jQuery and AEM",
			"link": "https://www.sanex.co.uk/"
		},
		"pilka-nozna-pl": {
			"image": "/assets/pilka-nozna-pl.png",
			"description": "A side project I was invited to by a front-end developer from VML. A football blog built in WordPress using PHP and the Blade templating engine.",
			"challenges": "The main challenge was ensuring a consistent structure for components developed by multiple devs, and arranging them according to the provided design.",
			"solutions": "I was responsible for testing components, preparing client-facing documentation, building templates, and configuring WordPress (e.g. navigation). I suggested ways to structure reusable components for easier content management. I also reported visual and functional issues. The project was completed as part of my freelance work under my business.",
			"tasks": "Component testing, documentation, working with WordPress and Blade, template creation, reporting bugs and optimization ideas, freelance collaboration with invoicing",
			"link": "https://pilkanozna.pl/"
		},
		"trilllizo": {
			"image": "/assets/trilllizo.png",
			"description": "An online clothing store developed for a client using WordPress and Elementor Pro. The site includes two language versions: Polish (.pl) and English (.com).",
			"challenges": "The biggest challenge was managing the project end-to-end — from WordPress installation and UI design to payment system integration, InPost shipping setup, and newsletter configuration.",
			"solutions": "I handled all aspects of the implementation: server setup, custom UI tailored to the client’s needs, e-commerce integration, SEO and image optimization, and creation of user documentation. Currently, I’m working with the client on further development including blog content (content marketing) and new features. The project was delivered under my registered business.",
			"tasks": "WordPress setup and configuration, UI design and implementation, payment and delivery integration, SEO and image optimization, multilingual setup, user documentation, post-launch support",
			"link": "https://trilllizo.com"
		}
	},
	"contact": {
		"name": "Name",
		"email": "Email",
		"message": "Message",
		"submit": "Submit",
		"error": "The message could not be sent - check if the fields have been filled in correctly",
		"success": "The message has been sent",
		"address": "32-070 Czernichów (near Krakow)"
	}
}
